<template>
  <div>
    闭包是指在一个函数内部创建另一个函数，并且内部函数可以访问外部函数的变量、
    参数以及其他内部函数，即使外部函数已经执行完毕。这种机制使得内部函数保留了对外部作用域的引用，即使外部作用域已经不再活跃。
    <highlightjs
      language="js"
      code="
      // 闭包在 JavaScript 中具有重要的用途和价值。它们可以用于创建私有变量、封装逻辑、避免全局污染等方面。
      // 另外，闭包还允许你在函数之外操作局部变量，从而为代码提供更大的灵活性和可维护性。
      JavaScript 闭包的特点

      闭包可以访问外部函数的变量，即使外部函数已经返回了。
      闭包保存外部函数变量的引用，而不是实际的值。
      每当一个函数在另一个函数中被创建时，就会产生闭包。

      JS 闭包的用途

      闭包常被用于:
      封装 - 内部函数可以访问外部变量,但外部函数不能访问内部变量。这提供了封装和数据私密性。
      状态持续 - 闭包可以在函数调用之间保持状态(例如计数器)。函数的变量在调用之间持续存在。
      偏函数应用 - 闭包可以用于偏函数应用和柯里化函数。这涉及到创建一个捕获一些参数但保留其他参数未设置的函数。

      // https://zhuanlan.zhihu.com/p/651784228
      ">
    </highlightjs>
  </div>
</template>

<script setup lang="ts">
  
</script>

<style scoped lang="less">
  
</style>